{
  "ir_version": 1,
  "id": "wf-min",
  "name": "Minimal linear flow",
  "runtime": "native",
  "provenance": {
    "adapter_id": "native",
    "runtime": "native",
    "adapter_version": null,
    "source_file": null,
    "exported_via": "export_workflow",
    "imported_at": null
  },
  "nodes": [
    {
      "id": "__start__",
      "label": "START",
      "kind": "start",
      "tool": null,
      "mcp_tool": null,
      "model_call": null,
      "human_gate": null,
      "consensus": null,
      "risk": {
        "level": "low",
        "score": 0.0,
        "signals": [],
        "rationale": null,
        "source": "heuristic"
      },
      "capabilities": [],
      "side_effects": [],
      "budget": null,
      "audit_boundary": null,
      "replay_marker": null,
      "trust_annotation": null,
      "privileged": false,
      "write_path": null,
      "eval_metadata": {},
      "metadata": {}
    },
    {
      "id": "agent",
      "label": "Agent",
      "kind": "agent",
      "tool": null,
      "mcp_tool": null,
      "model_call": null,
      "human_gate": null,
      "consensus": null,
      "risk": {
        "level": "low",
        "score": 0.0,
        "signals": [],
        "rationale": null,
        "source": "heuristic"
      },
      "capabilities": [],
      "side_effects": [],
      "budget": null,
      "audit_boundary": null,
      "replay_marker": null,
      "trust_annotation": null,
      "privileged": false,
      "write_path": null,
      "eval_metadata": {},
      "metadata": {}
    },
    {
      "id": "__end__",
      "label": "END",
      "kind": "end",
      "tool": null,
      "mcp_tool": null,
      "model_call": null,
      "human_gate": null,
      "consensus": null,
      "risk": {
        "level": "low",
        "score": 0.0,
        "signals": [],
        "rationale": null,
        "source": "heuristic"
      },
      "capabilities": [],
      "side_effects": [],
      "budget": null,
      "audit_boundary": null,
      "replay_marker": null,
      "trust_annotation": null,
      "privileged": false,
      "write_path": null,
      "eval_metadata": {},
      "metadata": {}
    }
  ],
  "edges": [
    {
      "id": "e1",
      "from_node": "__start__",
      "to_node": "agent",
      "conditional": false,
      "condition": null,
      "label": null,
      "metadata": {}
    },
    {
      "id": "e2",
      "from_node": "agent",
      "to_node": "__end__",
      "conditional": false,
      "condition": null,
      "label": null,
      "metadata": {}
    }
  ],
  "entry_points": [
    "__start__"
  ],
  "risk": {
    "level": "low",
    "score": 0.0,
    "signals": [],
    "rationale": null,
    "source": "heuristic"
  },
  "consensus": {
    "protocol": null,
    "suggested_protocol": null,
    "min_workers": null,
    "source": "default"
  },
  "graph_hash": "ae2790b9806a4f82e872889c7554042db0ee3ab184d245d0547d2eddde9c52b5",
  "compiled_at": null,
  "metadata": {}
}